Model: "functional_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 32, 32, 3)]       0         
_________________________________________________________________
zero_padding2d_6 (ZeroPaddin (None, 36, 36, 3)         0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 32, 32, 192)       14400     
_________________________________________________________________
batch_normalization_14 (Batc (None, 32, 32, 192)       768       
_________________________________________________________________
activation_14 (Activation)   (None, 32, 32, 192)       0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 32, 32, 160)       30720     
_________________________________________________________________
batch_normalization_15 (Batc (None, 32, 32, 160)       640       
_________________________________________________________________
activation_15 (Activation)   (None, 32, 32, 160)       0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 32, 32, 96)        15360     
_________________________________________________________________
batch_normalization_16 (Batc (None, 32, 32, 96)        384       
_________________________________________________________________
activation_16 (Activation)   (None, 32, 32, 96)        0         
_________________________________________________________________
zero_padding2d_7 (ZeroPaddin (None, 33, 33, 96)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 16, 96)        0         
_________________________________________________________________
zero_padding2d_8 (ZeroPaddin (None, 20, 20, 96)        0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 16, 16, 192)       460800    
_________________________________________________________________
batch_normalization_17 (Batc (None, 16, 16, 192)       768       
_________________________________________________________________
activation_17 (Activation)   (None, 16, 16, 192)       0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 16, 16, 192)       36864     
_________________________________________________________________
batch_normalization_18 (Batc (None, 16, 16, 192)       768       
_________________________________________________________________
activation_18 (Activation)   (None, 16, 16, 192)       0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 16, 16, 192)       36864     
_________________________________________________________________
batch_normalization_19 (Batc (None, 16, 16, 192)       768       
_________________________________________________________________
activation_19 (Activation)   (None, 16, 16, 192)       0         
_________________________________________________________________
zero_padding2d_9 (ZeroPaddin (None, 18, 18, 192)       0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 8, 8, 192)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 12288)             0         
_________________________________________________________________
dense_5 (Dense)              (None, 200)               2457800   
_________________________________________________________________
batch_normalization_26 (Batc (None, 200)               800       
_________________________________________________________________
activation_26 (Activation)   (None, 200)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 200)               40200     
_________________________________________________________________
batch_normalization_27 (Batc (None, 200)               800       
_________________________________________________________________
activation_27 (Activation)   (None, 200)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 10)                2010      
=================================================================
Total params: 3,100,714
Trainable params: 3,097,866
Non-trainable params: 2,848
_________________________________________________________________
