Model: "functional_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         [(None, 32, 32, 3)]       0         
_________________________________________________________________
zero_padding2d_12 (ZeroPaddi (None, 36, 36, 3)         0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 32, 32, 192)       14400     
_________________________________________________________________
batch_normalization_28 (Batc (None, 32, 32, 192)       768       
_________________________________________________________________
activation_28 (Activation)   (None, 32, 32, 192)       0         
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 32, 32, 160)       30720     
_________________________________________________________________
batch_normalization_29 (Batc (None, 32, 32, 160)       640       
_________________________________________________________________
activation_29 (Activation)   (None, 32, 32, 160)       0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 32, 32, 96)        15360     
_________________________________________________________________
batch_normalization_30 (Batc (None, 32, 32, 96)        384       
_________________________________________________________________
activation_30 (Activation)   (None, 32, 32, 96)        0         
_________________________________________________________________
zero_padding2d_13 (ZeroPaddi (None, 33, 33, 96)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 16, 96)        0         
_________________________________________________________________
zero_padding2d_14 (ZeroPaddi (None, 20, 20, 96)        0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 16, 16, 192)       460800    
_________________________________________________________________
batch_normalization_31 (Batc (None, 16, 16, 192)       768       
_________________________________________________________________
activation_31 (Activation)   (None, 16, 16, 192)       0         
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 16, 16, 192)       36864     
_________________________________________________________________
batch_normalization_32 (Batc (None, 16, 16, 192)       768       
_________________________________________________________________
activation_32 (Activation)   (None, 16, 16, 192)       0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 16, 16, 192)       36864     
_________________________________________________________________
batch_normalization_33 (Batc (None, 16, 16, 192)       768       
_________________________________________________________________
activation_33 (Activation)   (None, 16, 16, 192)       0         
_________________________________________________________________
zero_padding2d_15 (ZeroPaddi (None, 18, 18, 192)       0         
_________________________________________________________________
average_pooling2d_2 (Average (None, 8, 8, 192)         0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 12288)             0         
_________________________________________________________________
dense_9 (Dense)              (None, 200)               2457800   
_________________________________________________________________
batch_normalization_40 (Batc (None, 200)               800       
_________________________________________________________________
activation_40 (Activation)   (None, 200)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 200)               40200     
_________________________________________________________________
batch_normalization_41 (Batc (None, 200)               800       
_________________________________________________________________
activation_41 (Activation)   (None, 200)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 10)                2010      
=================================================================
Total params: 3,100,714
Trainable params: 2,500,810
Non-trainable params: 599,904
_________________________________________________________________
