Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 32, 32, 3)]       0         
_________________________________________________________________
zero_padding2d (ZeroPadding2 (None, 36, 36, 3)         0         
_________________________________________________________________
conv2d (Conv2D)              (None, 32, 32, 192)       14400     
_________________________________________________________________
batch_normalization (BatchNo (None, 32, 32, 192)       768       
_________________________________________________________________
activation (Activation)      (None, 32, 32, 192)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 32, 32, 160)       30720     
_________________________________________________________________
batch_normalization_1 (Batch (None, 32, 32, 160)       640       
_________________________________________________________________
activation_1 (Activation)    (None, 32, 32, 160)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 96)        15360     
_________________________________________________________________
batch_normalization_2 (Batch (None, 32, 32, 96)        384       
_________________________________________________________________
activation_2 (Activation)    (None, 32, 32, 96)        0         
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 33, 33, 96)        0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 16, 16, 96)        0         
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 20, 20, 96)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 16, 192)       460800    
_________________________________________________________________
batch_normalization_3 (Batch (None, 16, 16, 192)       768       
_________________________________________________________________
activation_3 (Activation)    (None, 16, 16, 192)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 16, 16, 192)       36864     
_________________________________________________________________
batch_normalization_4 (Batch (None, 16, 16, 192)       768       
_________________________________________________________________
activation_4 (Activation)    (None, 16, 16, 192)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 16, 16, 192)       36864     
_________________________________________________________________
batch_normalization_5 (Batch (None, 16, 16, 192)       768       
_________________________________________________________________
activation_5 (Activation)    (None, 16, 16, 192)       0         
_________________________________________________________________
zero_padding2d_3 (ZeroPaddin (None, 18, 18, 192)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 8, 8, 192)         0         
_________________________________________________________________
flatten (Flatten)            (None, 12288)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 200)               2457800   
_________________________________________________________________
batch_normalization_12 (Batc (None, 200)               800       
_________________________________________________________________
activation_12 (Activation)   (None, 200)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 200)               40200     
_________________________________________________________________
batch_normalization_13 (Batc (None, 200)               800       
_________________________________________________________________
activation_13 (Activation)   (None, 200)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                2010      
=================================================================
Total params: 3,100,714
Trainable params: 3,097,866
Non-trainable params: 2,848
_________________________________________________________________
